# Pandas introduction

In [26]:
import numpy as np
import pandas as pd

In [8]:
data_path = '../data/Churn_Modelling.csv'

In [9]:
df = pd.read_csv(data_path)

shape and colums

In [10]:
print(df.shape)
print(df.columns)

(10000, 14)
Index(['RowNumber', 'CustomerId', 'Surname', 'CreditScore', 'Geography',
       'Gender', 'Age', 'Tenure', 'Balance', 'NumOfProducts', 'HasCrCard',
       'IsActiveMember', 'EstimatedSalary', 'Exited'],
      dtype='object')

show top rows

In [11]:
df.head()

,RowNumber,CustomerId,Surname,CreditScore,Geography,Gender,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,Exited
0,1,15634602,Hargrave,619,France,Female,42,2,0.00,1,1,1,101348.88,1
1,2,15647311,Hill,608,Spain,Female,41,1,83807.86,1,0,1,112542.58,0
2,3,15619304,Onio,502,France,Female,42,8,159660.80,3,1,0,113931.57,1
3,4,15701354,Boni,699,France,Female,39,1,0.00,2,0,0,93826.63,0
4,5,15737888,Mitchell,850,Spain,Female,43,2,125510.82,1,1,1,79084.10,0

Select particular columns while reading

In [12]:
df_spec = pd.read_csv(data_path, usecols=['Gender', 'Age', 'Tenure', 'Balance'])
df_spec.head()

   Gender  Age  Tenure    Balance
0  Female   42       2       0.00
1  Female   41       1   83807.86
2  Female   42       8  159660.80
3  Female   39       1       0.00
4  Female   43       2  125510.82

Reading a part of the dataframe

In [14]:
df_partial = pd.read_csv(data_path, nrows=5000)
df_partial.shape

(5000, 14)

Sample

In [15]:
df_sample = df.sample(n=1000)
df_sample.shape

df_sample2 = df.sample(frac=0.1)
df_sample2.shape

(1000, 14)

Checking the missing values

In [16]:
df.isna().sum()

RowNumber          0
CustomerId         0
Surname            0
CreditScore        0
Geography          0
Gender             0
Age                0
Tenure             0
Balance            0
NumOfProducts      0
HasCrCard          0
IsActiveMember     0
EstimatedSalary    0
Exited             0
dtype: int64

Number of unique values in a column

In [31]:
df['Geography'].nunique()

3

Selecting rows based on conditions

In [17]:
# we can select colum by using 'df.{colum_name}'
france_churn = df[(df.Geography == 'France') & (df.Exited == 1)]
france_churn.Geography.value_counts()

Geography
France    810
Name: count, dtype: int64

Describing the conditions with query

In [18]:
df2 = df.query('80000 < Balance < 100000')

Describing the conditions with isin

In [19]:
df[df['Tenure'].isin([4,6,9,10])][:3]

,RowNumber,CustomerId,Surname,CreditScore,Geography,Gender,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,Exited
7,8,15656148,Obinna,376,Germany,Female,29,4,115046.74,4,1,0,119346.88,1
8,9,15792365,He,501,France,Male,44,4,142051.07,2,0,1,74940.50,0
10,11,15767821,Bearce,528,France,Male,31,6,102016.72,2,0,0,80181.12,0

groupby function

In [20]:
df[['Geography','Gender','Exited']].groupby(['Geography','Gender']).mean()

                    Exited
Geography Gender
France    Female  0.203450
          Male    0.127134
Germany   Female  0.375524
          Male    0.278116
Spain     Female  0.212121
          Male    0.131124

Applying multiple aggregate functions with groupby

In [21]:
df[['Geography','Gender','Exited']].groupby(['Geography','Gender']).agg(['mean','count'])

                    Exited
                      mean count
Geography Gender
France    Female  0.203450  2261
          Male    0.127134  2753
Germany   Female  0.375524  1193
          Male    0.278116  1316
Spain     Female  0.212121  1089
          Male    0.131124  1388

Applying different aggregate functions to different groups

In [22]:
df_summary = df[['Geography','Exited','Balance']].groupby('Geography')\
.agg({'Exited':'sum', 'Balance':'mean'})
df_summary.rename(columns={'Exited':'# of churned customers', 'Balance':'Average Balance of Customers'},inplace=True)
df_summary

           # of churned customers  Average Balance of Customers
Geography
France                        810                  62092.636516
Germany                       814                 119730.116134
Spain                         413                  61818.147763

Create new colums based on old colums

In [24]:
def rank_credit(score):
  if score > 600:
    return 'Very good'
  if 400 < score <= 600:
    return 'Good'
  else:
    return 'Bad'

In [29]:
df['CreditRankNp'] = np.where(df['CreditScore'] > 500, 'Good', 'Bad')
df['CreditRankAp'] = df['CreditScore'].apply(lambda x : rank_credit(x))
df.head()

,RowNumber,CustomerId,Surname,CreditScore,Geography,Gender,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,Exited,CreditRankNp,CreditRankAp
0,1,15634602,Hargrave,619,France,Female,42,2,0.00,1,1,1,101348.88,1,Good,Very good
1,2,15647311,Hill,608,Spain,Female,41,1,83807.86,1,0,1,112542.58,0,Good,Very good
2,3,15619304,Onio,502,France,Female,42,8,159660.80,3,1,0,113931.57,1,Good,Good
3,4,15701354,Boni,699,France,Female,39,1,0.00,2,0,0,93826.63,0,Good,Very good
4,5,15737888,Mitchell,850,Spain,Female,43,2,125510.82,1,1,1,79084.10,0,Good,Very good

Memory usage (bytes)

In [32]:
df.memory_usage()

Index                128
RowNumber          80000
CustomerId         80000
Surname            80000
CreditScore        80000
Geography          80000
Gender             80000
Age                80000
Tenure             80000
Balance            80000
NumOfProducts      80000
HasCrCard          80000
IsActiveMember     80000
EstimatedSalary    80000
Exited             80000
CreditRankNp       80000
CreditRankAp       80000
dtype: int64

In [33]:
df['Geography'] = df['Geography'].astype('category')
df.memory_usage()

Index                128
RowNumber          80000
CustomerId         80000
Surname            80000
CreditScore        80000
Geography          10132
Gender             80000
Age                80000
Tenure             80000
Balance            80000
NumOfProducts      80000
HasCrCard          80000
IsActiveMember     80000
EstimatedSalary    80000
Exited             80000
CreditRankNp       80000
CreditRankAp       80000
dtype: int64